tests/fixtures/fakturownia/invoice-detail.json

{"id":526728379,"user_id":3281794,"app":null,"number":"Z1","place":"Kraków","sell_date":"2026-06-22","payment_type":"transfer","price_net":"3240.74","price_gross":"3500.0","currency":"PLN","status":"paid","description":"Do ceny końcowej ZAM 1 zostanie naliczona kaucja w wysokości 2508,00 PLN","seller_name":"Zdrovena Maria Gryzlo","seller_tax_no":"7341123931","seller_street":"Cieszyńska 6","seller_post_code":"33-015","seller_city":"Kraków","seller_country":"PL","seller_email":"info@wodahumio.pl","seller_phone":"","seller_fax":"","seller_www":"","seller_person":"","seller_bank":null,"seller_bank_account":"PL79 1020 3453 0000 8302 0403 7701","buyer_name":"Dinx Gadgets","buyer_tax_no":"7252066835","buyer_post_code":"93-192","buyer_city":"Łódź","buyer_street":"Senatorska 21/32","buyer_first_name":"","buyer_country":"PL","created_at":"2026-07-02T15:14:58.000+02:00","updated_at":"2026-07-02T15:24:36.000+02:00","token":"E4LpjcqcxN1Xp2yQU7jr","buyer_email":"","buyer_www":null,"buyer_fax":null,"buyer_phone":"","kind":"advance","pattern":"Znr","pattern_nr":1,"pattern_nr_m":null,"pattern_nr_d":null,"client_id":257922059,"payment_to":"2026-07-09","paid":"3500.0","seller_bank_account_id":null,"lang":"pl","issue_date":"2026-07-02","price_tax":"259.26","department_id":1569412,"correction":null,"buyer_note":"","additional_info_desc":"PKWiU","additional_info":false,"product_cache":"HUMIO - woda alkaliczna, 12 butelek - personalizowane etykiety","buyer_last_name":"","from_invoice_id":526704054,"oid":"","discount":"0.0","show_discount":false,"sent_time":null,"print_time":"2026-07-02T15:24:36.000+02:00","recurring_id":null,"tax2_visible":null,"warehouse_id":120461,"paid_date":"2026-06-22","product_id":null,"issue_year":2026,"internal_note":"","invoice_id":null,"invoice_template_id":1459,"description_long":"","buyer_tax_no_kind":null,"seller_tax_no_kind":null,"description_footer":"","sell_date_kind":"ADVANCE_RECEIPT_DATE","payment_to_kind":"7","exchange_currency":null,"discount_kind":"percent_unit_gross","income":true,"from_api":false,"category_id":null,"warehouse_document_id":null,"exchange_kind":"nbp","exchange_rate":"1.0","use_delivery_address":false,"delivery_address":"","accounting_kind":null,"buyer_person":"","buyer_bank_account":null,"buyer_bank":null,"buyer_mass_payment_code":null,"exchange_note":"","buyer_company":true,"show_attachments":false,"exchange_currency_rate":null,"has_attachments":false,"exchange_date":null,"attachments_count":1,"delivery_date":"2026-07-02","fiscal_status":null,"use_moss":false,"calculating_strategy":{"position":"default","sum":"sum","invoice_form_price_kind":"gross"},"transaction_date":"2026-06-22","email_status":null,"exclude_from_stock_level":false,"exclude_from_accounting":false,"exchange_rate_den":"1.0","exchange_currency_rate_den":"1.0","accounting_scheme":null,"exchange_difference":"0.0","not_cost":false,"reverse_charge":false,"issuer":null,"use_issuer":false,"cancelled":false,"recipient_id":null,"recipient_name":null,"test":false,"discount_net":"0.0","approval_status":null,"accounting_vat_tax_date":"2026-06-22","accounting_income_tax_date":null,"accounting_other_tax_date":null,"accounting_status":null,"normalized_number":null,"na_tax_kind":null,"issued_to_receipt":false,"gov_id":null,"gov_kind":null,"gov_status":null,"sales_code":"0353-2054-391337","additional_invoice_field":null,"products_margin":null,"payment_url":null,"view_url":"https://zdrovena.fakturownia.net/f/Z1/E4LpjcqcxN1Xp2yQU7jr","buyer_mobile_phone":"","kind_text":"Faktura Zaliczkowa","invoice_for_receipt_id":null,"receipt_for_invoice_id":null,"payment_status":"paid","recipient_company":null,"recipient_first_name":null,"recipient_last_name":null,"recipient_tax_no":null,"recipient_street":null,"recipient_post_code":null,"recipient_city":null,"recipient_country":null,"recipient_email":null,"recipient_phone":null,"recipient_note":null,"overdue?":false,"get_tax_name":"VAT","get_tax2_name":"TAX","tax_visible?":true,"tax_name_type":"translation_tax","bank_accounts":[{"bank_name":"PKO Bank Polski","bank_account_number":"PL79 1020 3453 0000 8302 0403 7701","bank_currency":"PLN","bank_swift":"","formatted_bank_account_number":"PL79102034530000830204037701","name":"PKO Bank Polski","account_description":null,"own_bank_account":false,"factor_bank_account":false,"own_bank_account_type":null,"id":89728}],"use_oss":false,"document_posted":null,"adjust_invoice_price":"3500.0","check_fiscal_print":false,"fiscal_print_error":"\nNiepoprawna wartość brutto na pozycji 1. 418.0x HUMIO - woda alkaliczna, 12 butelek - personalizowane etykiety\nNiepoprawna wartość brutto na dokumencie","seller_bdo_no":"","split_payment":"0","gtu_codes":[],"procedure_designations":[],"procedure_vat_margin":null,"gov_link":null,"gov_verification_link":null,"buyer_jst":"0","buyer_gv":"0","positions":[{"id":1297025196,"invoice_id":526728379,"name":"HUMIO - woda alkaliczna, 12 butelek - personalizowane etykiety","description":null,"price_net":"7.75","quantity":"418.0","total_price_gross":"3500.0","total_price_net":"3240.74","account_id":2132613,"created_at":"2026-07-02T15:14:58.000+02:00","updated_at":"2026-07-02T15:14:58.000+02:00","additional_info":"","quantity_unit":"szt","tax":"8","price_gross":"8.37","price_tax":"0.62","total_price_tax":"259.26","kind":null,"invoice_position_id":null,"product_id":null,"deleted":false,"discount":null,"discount_percent":null,"tax2":"0","exchange_rate":"1.0","accounting_tax_kind":null,"code":null,"discount_net":null,"lump_sum_tax":null,"corrected_pos_kind":null,"gtu_code":null,"technical_tax":null}],"issuers":[],"recipients":[],"descriptions":[{"id":58279066,"kind":"Uwaga","content":"Do ceny końcowej ZAM 1 zostanie naliczona kaucja w wysokości 2508,00 PLN","position_index":null,"row_number":1}]}